app/controllers/api/v1/messages_controller.rb

            def index
                messages = Message.all
---
SELECT "messages".* FROM "messages"

            def create
                message = Message.new(message_params)
                if message.save
---
INSERT INTO "messages" ("greeting", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["greeting", "hi lol"], ["created_at", "2021-10-17 09:56:32.883249"], ["updated_at", "2021-10-17 09:56:32.883249"]]